<?xml version="1.0" ?>
<net batch="1" name="CTC_ISR_frezee" version="4">
	<layers>
		<layer id="0" name="inputs" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>40</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="transpose" precision="FP32" type="Permute">
			<data order="0,1,3,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>40</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="split" precision="FP32" type="Split">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Mul" precision="FP32" type="Power">
			<data power="1" scale="0.2989000082015991" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Mul_1" precision="FP32" type="Power">
			<data power="1" scale="0.5870000123977661" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Mul_2" precision="FP32" type="Power">
			<data power="1" scale="0.11400000005960464" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="add_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="mul_3" precision="FP32" type="Power">
			<data power="1" scale="0.017000000923871994" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Squeeze" precision="FP32" type="Reshape">
			<data dim="1,120,40"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="rnn/while/Enter_3/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="256"/>
			</blobs>
		</layer>
		<layer id="11" name="rnn/while/Enter_4/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="rnn/while/LoopCond/TensorIteratorCondition_/TensorIterator" precision="FP32" type="TensorIterator">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
				</port>
			</output>
			<port_map>
				<input axis="1" external_port_id="0" internal_layer_id="0" internal_port_id="0"/>
				<input external_port_id="1" internal_layer_id="1" internal_port_id="2"/>
				<input external_port_id="2" internal_layer_id="1" internal_port_id="1"/>
				<output axis="1" external_port_id="3" internal_layer_id="2" internal_port_id="1"/>
			</port_map>
			<back_edges>
				<edge from-layer="1" from-port="6" to-layer="1" to-port="2"/>
				<edge from-layer="1" from-port="5" to-layer="1" to-port="1"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="rnn/while/TensorArrayReadV3/Output_0/Data_/InputSqueeze" precision="FP32" type="Reshape">
						<data dim="-1,40"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>40</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>40</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="rnn/while/lstm_cell/concat/LSTMCell" precision="FP32" type="LSTMCell">
						<data hidden_size="64"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>40</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>64</dim>
							</port>
							<port id="2">
								<dim>1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="5">
								<dim>1</dim>
								<dim>64</dim>
							</port>
							<port id="6">
								<dim>1</dim>
								<dim>64</dim>
							</port>
						</output>
						<blobs>
							<weights offset="3856" size="106496"/>
							<biases offset="110352" size="1024"/>
						</blobs>
					</layer>
					<layer id="2" name="rnn/while/lstm_cell/concat/LSTMCell/Output_0/Data_/OutputUnsqueeze" precision="FP32" type="Reshape">
						<data dim="-1,1,64"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>64</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>1</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="1" to-layer="1" to-port="0"/>
					<edge from-layer="1" from-port="5" to-layer="2" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="13" name="Reshape" precision="FP32" type="Reshape">
			<data dim="120,64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>120</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="MatMul" precision="FP32" type="FullyConnected">
			<data out-size="12"/>
			<input>
				<port id="0">
					<dim>120</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>120</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="256" size="3072"/>
				<biases offset="3328" size="48"/>
			</blobs>
		</layer>
		<layer id="15" name="Reshape_1" precision="FP32" type="Reshape">
			<data dim="1,120,12"/>
			<input>
				<port id="0">
					<dim>120</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="transpose_1" precision="FP32" type="Permute">
			<data order="1,0,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>120</dim>
					<dim>1</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Fill_1/Output_0/Data__const" precision="FP32" type="Const">
			<output>
				<port id="1">
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3376" size="480"/>
			</blobs>
		</layer>
		<layer id="18" name="CTCGreedyDecoder" precision="FP32" type="CTCGreedyDecoder">
			<data ctc_merge_repeated="1"/>
			<input>
				<port id="0">
					<dim>120</dim>
					<dim>1</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="3" to-layer="3" to-port="0"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="2" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="2"/>
		<edge from-layer="12" from-port="3" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
	</edges>
	<meta_data>
		<MO_version value="1.5.12.49d067a0"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR\CTC_ISR_frezee.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,40,120,3]"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<offload_unsupported_operations_to_tf value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_checkpoint, input_meta_graph, model_name, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
